#include "stm32f10x.h"
#include "core_cm3.h"

#include "SysLed/SysLed.h"

//==============================================================================
// Счетчик системного таймера
volatile uint8 microToMs = 0;
volatile uint32 systick_ms = 0;
volatile uint32 microSecCount = 0;

//==============================================================================

//-----------------------------------------------------------
//----------------- SysTick_Handler -------------------------
//-----------------------------------------------------------
void SysTick_Handler(void) {
  microSecCount++;
  microToMs++;
  if (microToMs >= 80) {
    systick_ms++;
    microToMs = 0;
  }
  
  
    // Моргалка
  sysLedHandler();
}

//-----------------------------------------------------------
//--------------- getMicroSysTickCount ----------------------
//-----------------------------------------------------------
uint32 getMicroSysTickCount(void) {
  return microSecCount;
}

//-----------------------------------------------------------
//----------------- getSysTickCount -------------------------
//-----------------------------------------------------------
uint32 getSysTickCount(void) {
  return systick_ms;
}


//-----------------------------------------------------------
//------------------- initSysTick ---------------------------
//-----------------------------------------------------------
void initSysTick(void) {
  // Инициализация системного таймера
  // 1/16 ms
  SysTick_Config(800);
}
